{
  "version": "1",
  "metadata": {
    "marimo_version": "0.19.2"
  },
  "cells": [
    {
      "id": "Hbol",
      "code_hash": "6d1658525cbe62cc4b6713981774f663",
      "outputs": [
        {
          "type": "data",
          "data": {
            "text/markdown": "<span class=\"markdown prose dark:prose-invert contents\"><h1 id=\"mini-challenge-3\">Mini-Challenge 3</h1>\n<ul>\n<li>Singh AmanDeep</li>\n<li>Kim Wilmink</li>\n<li>Dominic van den Bungelaar</li>\n</ul>\n<h2 id=\"tasks-questions\">Tasks &amp; Questions:</h2>\n<span class=\"paragraph\">Clepper diligently recorded all intercepted radio communications over the last two weeks. With the help of his intern, they have analyzed their content to identify important events and relationships between key players. The result is a knowledge graph describing the last two weeks on Oceanus. Clepper and his intern have spent a large amount of time generating this knowledge graph, and they would now like some assistance using it to answer the following questions.</span>\n<ol>\n<li>\n<span class=\"paragraph\">Clepper found that messages frequently came in at around the same time each day.</span>\n<ul>\n<li>Develop a graph-based visual analytics approach to identify any daily temporal patterns in communications.</li>\n<li>How do these patterns shift over the two weeks of observations?</li>\n<li>Focus on a specific entity and use this information to determine who has influence over them.</li>\n</ul>\n</li>\n<li>\n<span class=\"paragraph\">Clepper has noticed that people often communicate with (or about) the same people or vessels, and that grouping them together may help with the investigation.</span>\n<ul>\n<li>Use visual analytics to help Clepper understand and explore the interactions and relationships between vessels and people in the knowledge graph.</li>\n<li>\n<span class=\"paragraph\">Are there groups that are more closely associated? If so, what are the topic areas that are predominant for each group?</span>\n<ul>\n<li>For example, these groupings could be related to: Environmentalism (known associates of Green Guardians), Sailor Shift, and fishing/leisure vessels.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<span class=\"paragraph\">It was noted by Clepper’s intern that some people and vessels are using pseudonyms to communicate.</span>\n<ul>\n<li>\n<span class=\"paragraph\">Expanding upon your prior visual analytics, determine who is using pseudonyms to communicate, and what these pseudonyms are.</span>\n<ul>\n<li>Some that Clepper has already identified include: “Boss”, and “The Lookout”, but there appear to be many more.</li>\n<li>To complicate the matter, pseudonyms may be used by multiple people or vessels.</li>\n</ul>\n</li>\n<li>Describe how your visualizations make it easier for Clepper to identify common entities in the knowledge graph.</li>\n<li>How does your understanding of activities change given your understanding of pseudonyms?</li>\n</ul>\n</li>\n<li>\n<span class=\"paragraph\">Clepper suspects that Nadia Conti, who was formerly entangled in an illegal fishing scheme, may have continued illicit activity within Oceanus.</span>\n<ul>\n<li>Through visual analytics, provide evidence that Nadia is, or is not, doing something illegal.</li>\n<li>Summarize Nadia’s actions visually. Are Clepper’s suspicions justified?</li>\n</ul>\n</li>\n</ol></span>"
          }
        }
      ],
      "console": []
    },
    {
      "id": "MJUe",
      "code_hash": "1d0db38904205bec4d6f6f6a1f6cec3e",
      "outputs": [
        {
          "type": "data",
          "data": {
            "text/plain": ""
          }
        }
      ],
      "console": []
    }
  ]
}